## Production: ecr
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                             NAME                             |
|--------|--------------------------------------------------------------|
| add    | `aws_ecr_lifecycle_policy.forms_app_legacy_policy`           |
|        | `aws_ecr_lifecycle_policy.lambda[&quot;prisma-migration-lambda&quot;]` |
|        | `aws_ecr_repository.forms_app_legacy_repository`             |
|        | `aws_ecr_repository.lambda[&quot;prisma-migration-lambda&quot;]`       |
| delete | `aws_ecr_lifecycle_policy.lambda[&quot;load-testing-lambda&quot;]`     |
|        | `aws_ecr_repository.lambda[&quot;load-testing-lambda&quot;]`           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.forms_app_legacy_policy will be created
  + resource "aws_ecr_lifecycle_policy" "forms_app_legacy_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "forms_app_legacy"
    }

  # aws_ecr_lifecycle_policy.lambda["load-testing-lambda"] will be destroyed
  # (because key ["load-testing-lambda"] is not in for_each map)
  - resource "aws_ecr_lifecycle_policy" "lambda" {
      - id          = "load-testing-lambda" -> null
      - policy      = jsonencode(
            {
              - rules = [
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Keep last 10 images"
                      - rulePriority = 1
                      - selection    = {
                          - countNumber = 10
                          - countType   = "imageCountMoreThan"
                          - tagStatus   = "any"
                        }
                    },
                ]
            }
        ) -> null
      - registry_id = "957818836222" -> null
      - repository  = "load-testing-lambda" -> null
    }

  # aws_ecr_lifecycle_policy.lambda["prisma-migration-lambda"] will be created
  + resource "aws_ecr_lifecycle_policy" "lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "prisma-migration-lambda"
    }

  # aws_ecr_repository.forms_app_legacy_repository will be created
  + resource "aws_ecr_repository" "forms_app_legacy_repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "forms_app_legacy"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.lambda["load-testing-lambda"] will be destroyed
  # (because key ["load-testing-lambda"] is not in for_each map)
  - resource "aws_ecr_repository" "lambda" {
      - arn                  = "arn:aws:ecr:ca-central-1:957818836222:repository/load-testing-lambda" -> null
      - id                   = "load-testing-lambda" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "load-testing-lambda" -> null
      - registry_id          = "957818836222" -> null
      - repository_url       = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/load-testing-lambda" -> null
      - tags                 = {} -> null
      - tags_all             = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
            # (1 unchanged attribute hidden)
        }

      - image_scanning_configuration {
          - scan_on_push = true -> null
        }
    }

  # aws_ecr_repository.lambda["prisma-migration-lambda"] will be created
  + resource "aws_ecr_repository" "lambda" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "prisma-migration-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 4 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + ecr_repository_lambda_urls                         = {
      + audit-logs-archiver-lambda      = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/audit-logs-archiver-lambda"
      + audit-logs-lambda               = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/audit-logs-lambda"
      + cognito-email-sender-lambda     = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/cognito-email-sender-lambda"
      + cognito-pre-sign-up-lambda      = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/cognito-pre-sign-up-lambda"
      + form-archiver-lambda            = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/form-archiver-lambda"
      + nagware-lambda                  = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/nagware-lambda"
      + notify-slack-lambda             = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/notify-slack-lambda"
      + prisma-migration-lambda         = (known after apply)
      + reliability-dlq-consumer-lambda = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/reliability-dlq-consumer-lambda"
      + reliability-lambda              = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/reliability-lambda"
      + response-archiver-lambda        = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/response-archiver-lambda"
      + submission-lambda               = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/submission-lambda"
      + vault-integrity-lambda          = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/vault-integrity-lambda"
    }
  - ecr_repository_url_audit_logs_archiver_lambda      = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/audit-logs-archiver-lambda" -> null
  - ecr_repository_url_audit_logs_lambda               = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/audit-logs-lambda" -> null
  - ecr_repository_url_form_archiver_lambda            = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/form-archiver-lambda" -> null
  - ecr_repository_url_load_testing_lambda             = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/load-testing-lambda" -> null
  - ecr_repository_url_nagware_lambda                  = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/nagware-lambda" -> null
  - ecr_repository_url_reliability_dlq_consumer_lambda = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/reliability-dlq-consumer-lambda" -> null
  - ecr_repository_url_reliability_lambda              = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/reliability-lambda" -> null
  - ecr_repository_url_response_archiver_lambda        = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/response-archiver-lambda" -> null
  - ecr_repository_url_submission_lambda               = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/submission-lambda" -> null
  - ecr_repository_url_vault_integrity_lambda          = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/vault-integrity-lambda" -> null

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.forms_app_legacy_repository"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.idp"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"audit-logs-archiver-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"audit-logs-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"cognito-email-sender-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"cognito-pre-sign-up-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"form-archiver-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"nagware-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"notify-slack-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"prisma-migration-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"reliability-dlq-consumer-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"reliability-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"response-archiver-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"submission-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"vault-integrity-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.viewer_repository"]

36 tests, 19 passed, 17 warnings, 0 failures, 0 exceptions

```

</details>
